# Pandas3, Pandas4

# Correlation and Covariance

study link:https://machinelearningmastery.com/how-to-use-correlation-to-understand-the-relationship-between-variables/

In [4]:
import pandas as pd
import numpy as np
import pandas_datareader.data as web

In [5]:
# dictionary comprehension

all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [6]:
price = pd.DataFrame({ticker: data['Adj Close'] 
                      for (ticker, data) in all_data.items()})

In [7]:
price

                  AAPL         IBM        MSFT         GOOG
Date
2016-03-11   23.778234  114.159302   48.663696   726.820007
2016-03-14   23.838688  114.496071   48.755386   730.489990
2016-03-15   24.317701  114.640419   49.140518   728.330017
2016-03-16   24.640911  116.107918   49.837418   736.090027
2016-03-17   24.601379  117.912178   50.121674   737.780029
...                ...         ...         ...          ...
2021-03-04  120.129997  120.110001  226.729996  2049.090088
2021-03-05  121.419998  122.830002  231.600006  2108.540039
2021-03-08  116.360001  124.809998  227.389999  2024.170044
2021-03-09  121.089996  124.180000  233.779999  2052.699951
2021-03-10  119.980003  127.870003  232.419998  2055.030029

[1258 rows x 4 columns]

In [8]:
volume = pd.DataFrame({ticker: data['Volume'] for (ticker, data) in all_data.items()})

In [12]:
volume.name = 'Volume'
volume.head()

                   AAPL        IBM        MSFT     GOOG
Date
2016-03-11  109632800.0  4421900.0  32275700.0  1970800
2016-03-14  100304400.0  4048800.0  24083600.0  1718300
2016-03-15  160270800.0  3707500.0  21104800.0  1721000
2016-03-16  153214000.0  4221900.0  31691700.0  1624400
2016-03-17  137682800.0  5821600.0  28223900.0  1860800

In [13]:
returns = price.pct_change()

In [15]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2021-03-04 -0.015812 -0.018388 -0.003647  0.011043
2021-03-05  0.010738  0.022646  0.021479  0.029013
2021-03-08 -0.041674  0.016120 -0.018178 -0.040013
2021-03-09  0.040650 -0.005048  0.028101  0.014095
2021-03-10 -0.009167  0.029715 -0.005817  0.001135

In [16]:
returns['MSFT'].corr(returns['IBM'])

0.5346232246561983

In [17]:
returns['MSFT'].cov(returns['IBM'])

0.00015184679764529855

In [18]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.447982  0.711800  0.651112
IBM   0.447982  1.000000  0.534623  0.503474
MSFT  0.711800  0.534623  1.000000  0.778418
GOOG  0.651112  0.503474  0.778418  1.000000

In [19]:
returns.corrwith(returns.IBM)

AAPL    0.447982
IBM     1.000000
MSFT    0.534623
GOOG    0.503474
dtype: float64

## Pandas 4